# Homework  
Data documentation: https://tidyr.tidyverse.org/reference/who.html

Directions: Answer the three questions below. Create as many code/markdown blocks necessary to answer the questions.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

df = pd.read_csv('who.csv')

In [2]:
df = df.drop(columns=['iso2', 'iso3'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7240 entries, 0 to 7239
Data columns (total 58 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   country       7240 non-null   object
 1   year          7240 non-null   int64
 2   new_sp_m014   3173 non-null   float64
 3   new_sp_m1524  3209 non-null   float64
 4   new_sp_m2534  3206 non-null   float64
 5   new_sp_m3544  3219 non-null   float64
 6   new_sp_m4554  3223 non-null   float64
 7   new_sp_m5564  3218 non-null   float64
 8   new_sp_m65    3209 non-null   float64
 9   new_sp_f014   3174 non-null   float64
 10  new_sp_f1524  3194 non-null   float64
 11  new_sp_f2534  3200 non-null   float64
 12  new_sp_f3544  3199 non-null   float64
 13  new_sp_f4554  3204 non-null   float64
 14  new_sp_f5564  3195 non-null   float64
 15  new_sp_f65    3197 non-null   float64
 16  new_sn_m014   1045 non-null   float64
 17  new_sn_m1524  1030 non-null   float64
 18  new_sn_m2534  1022 non-null   float64
 19  new_sn_m3544  1025 non-null   float64
 20  new_sn_m4554  1027 non-null   float64
 21  new_sn_m5564  1021 non-null   float64
 22  new_sn_m65    1020 non-null   float64
 23  new_sn_f014   1040 non-null   float64
 24  new_sn_f1524  1022 non-null   float64
 25  new_sn_f2534  1016 non-null   float64
 26  new_sn_f3544  1020 non-null   float64
 27  new_sn_f4554  1018 non-null   float64
 28  new_sn_f5564  1017 non-null   float64
 29  new_sn_f65    1019 non-null   float64
 30  new_ep_m014   1038 non-null   float64
 31  new_ep_m1524  1026 non-null   float64
 32  new_ep_m2534  1020 non-null   float64
 33  new_ep_m3544  1024 non-null   float64
 34  new_ep_m4554  1020 non-null   float64
 35  new_ep_m5564  1015 non-null   float64
 36  new_ep_m65    1018 non-null   float64
 37  new_ep_f014   1032 non-null   float64
 38  new_ep_f1524  1021 non-null   float64
 39  new_ep_f2534  1021 non-null   float64
 40  new_ep_f3544  1021 non-null   float64
 41  new_ep_f4554  1017 non-null   float64
 42  new_ep_f5564  1017 non-null   float64
 43  new_ep_f65    1014 non-null   float64
 44  newrel_m014   190 non-null    float64
 45  newrel_m1524  182 non-null    float64
 46  newrel_m2534  183 non-null    float64
 47  newrel_m3544  184 non-null    float64
 48  newrel_m4554  184 non-null    float64
 49  newrel_m5564  185 non-null    float64
 50  newrel_m65    182 non-null    float64
 51  newrel_f014   190 non-null    float64
 52  newrel_f1524  184 non-null    float64
 53  newrel_f2534  182 non-null    float64
 54  newrel_f3544  183 non-null    float64
 55  newrel_f4554  183 non-null    float64
 56  newrel_f5564  183 non-null    float64
 57  newrel_f65    185 non-null    float64
dtypes: float64(56), int64(1), object(1)
memory usage: 3.2+ MB

#### Question 1. We need to know what's included in this data.
- How many countries are present?  
- What's the timespan of the data?  
- Does each country have a row for every year present?  
- Which countries are missing years?  
- How many rows have at least 1 non-null values across the columns 3-57?

#### 1.1. How many Countries are present

In [5]:
df.country.nunique()

219

#### 1.2. Whats the timespan of the data

In [6]:
df.year.unique()

array([1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990,
       1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001,
       2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012,
       2013], dtype=int64)

In [7]:
df.year.nunique()

34

#### 1.3. Does each country have a row for every year present?

No, not all countries have every year in the given data

In [53]:
df1 = df[['year','country']]
#df1.head()
df2 = df1.groupby('country').count().sort_values(by='year')
df2 = df2.rename(columns={'year':'count'})
df2

                                   count
country
South Sudan                            3
Curacao                                4
Bonaire, Saint Eustatius and Saba      4
Sint Maarten (Dutch part)              4
Serbia                                 9
...                                  ...
Greece                                34
Greenland                             34
Grenada                               34
Fiji                                  34
Zimbabwe                              34

[219 rows x 1 columns]

#### 1.4. Which countries are missing years?

In [54]:
df2.query('count<34') #Countries that have years missing

                                   count
country
South Sudan                            3
Curacao                                4
Bonaire, Saint Eustatius and Saba      4
Sint Maarten (Dutch part)              4
Serbia                                 9
Montenegro                             9
Timor-Leste                           12
Serbia & Montenegro                   25
Netherlands Antilles                  30

#### 1.5. How many rows have at least 1 non-null values across the columns 3-57?

In [ ]:
# Code

#### Question 2: Wide data isn't usually helpful.
Convert this to a long format with the following columns:  
1. country  
2. year  
3. diagnosis method: mapping should be: 

  {'newsp':'Pulmonary Smear (+)'
  ,'newsn':'Pulmonary Smear (-)'
  ,'newep':'Extrapulmonary'
  ,'newrel':'Relapse'}   
  

4. gender: male or female.   
5. age: lower_age - higher_age, e.g., 0-14  
6. number of cases

In [67]:
df_long= pd.melt(df,id_vars=['country','year'],var_name=['new_sp'],value_name='Cases')
df_long

            country  year       new_sp  Cases
0       Afghanistan  1980  new_sp_m014    NaN
1       Afghanistan  1981  new_sp_m014    NaN
2       Afghanistan  1982  new_sp_m014    NaN
3       Afghanistan  1983  new_sp_m014    NaN
4       Afghanistan  1984  new_sp_m014    NaN
...             ...   ...          ...    ...
405435     Zimbabwe  2009   newrel_f65    NaN
405436     Zimbabwe  2010   newrel_f65    NaN
405437     Zimbabwe  2011   newrel_f65    NaN
405438     Zimbabwe  2012   newrel_f65    NaN
405439     Zimbabwe  2013   newrel_f65  725.0

[405440 rows x 4 columns]

In [79]:
import re
df_long['Sex'] = df_long['new_sp'].apply(lambda x:'male' if re.search(r'_m',x) else 'women' )
df_long.tail()

         country  year      new_sp  Cases    Sex
405435  Zimbabwe  2009  newrel_f65    NaN  women
405436  Zimbabwe  2010  newrel_f65    NaN  women
405437  Zimbabwe  2011  newrel_f65    NaN  women
405438  Zimbabwe  2012  newrel_f65    NaN  women
405439  Zimbabwe  2013  newrel_f65  725.0  women

In [102]:
df_long['Age'] = df_long['new_sp'].apply(lambda x:  re.search(r'[0-9]+',x))
df_long.head()

,country,year,new_sp,Cases,Sex,Age
0,Afghanistan,1980,new_sp_m014,NaN,male,"<re.Match object; span=(8, 11), match='014'>"
1,Afghanistan,1981,new_sp_m014,NaN,male,"<re.Match object; span=(8, 11), match='014'>"
2,Afghanistan,1982,new_sp_m014,NaN,male,"<re.Match object; span=(8, 11), match='014'>"
3,Afghanistan,1983,new_sp_m014,NaN,male,"<re.Match object; span=(8, 11), match='014'>"
4,Afghanistan,1984,new_sp_m014,NaN,male,"<re.Match object; span=(8, 11), match='014'>"

In [105]:
df_long['Age'] = df_long['new_sp'].apply(lambda x:  re.sub(r'\D','',x))
df_long.head()

       country  year       new_sp  Cases   Sex  Age
0  Afghanistan  1980  new_sp_m014    NaN  male  014
1  Afghanistan  1981  new_sp_m014    NaN  male  014
2  Afghanistan  1982  new_sp_m014    NaN  male  014
3  Afghanistan  1983  new_sp_m014    NaN  male  014
4  Afghanistan  1984  new_sp_m014    NaN  male  014

In [131]:
df_long['Age'] = df_long['Age'] .astype('string')
df_long.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405440 entries, 0 to 405439
Data columns (total 7 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   country       405440 non-null  object
 1   year          405440 non-null  int64
 2   new_sp        405440 non-null  object
 3   Cases         76046 non-null   float64
 4   Sex           405440 non-null  object
 5   Age           405440 non-null  string
 6   Age_Category  405440 non-null  object
dtypes: float64(1), int64(1), object(4), string(1)
memory usage: 21.7+ MB

In [220]:
df_long.Age_Category2.unique()

array(['14', '1524', '2534', '3544', '4554', '55-64', '65'], dtype=object)

In [ ]:
df_long['Sex'] = df_long['new_sp'].apply(lambda x:'male' if re.search(r'_m',x) else 'women' )

In [219]:
df_long['Age_Category2'] = df_long['Age'].apply(lambda x: '45-54' if re.search(r'4554',x) else x)
df_long['Age_Category2'] = df_long['Age'].apply(lambda x: '55-64' if re.search(r'5564',x) else x)

In [203]:
df_long['Age_Category'] = df_long['Age'].apply(lambda x: re.sub(r'65', '65', x))
df_long['Age_Category'] = df_long['Age'].apply(lambda x: re.sub(r'014', '0-14', x))
df_long['Age_Category'] = df_long['Age'].apply(lambda x: re.sub(r'1524', '15-24', x))
df_long['Age_Category'] = df_long['Age'].apply(lambda x: re.sub(r'2534', '25-34', x))
df_long['Age_Category'] = df_long['Age'].apply(lambda x: re.sub(r'4554', '45-54', x))
df_long['Age_Category'] = df_long['Age'].apply(lambda x: re.sub(r'5564', '55-64', x))

In [172]:

# Create a function that returns desired values
# You only need to check upper bound as the next elif-statement will catch the value
def func1(x):
    if lambda x:  re.sub(r'14','0-14',x):
        return "0-14"
    elif lambda x: re.findall(r'65',x):
        return "65"
    elif lambda x:  re.sub(r'1524','',x):
        return "15-24"
    elif lambda x:  re.sub(r'2534','',x):
        return "25-34"
    elif lambda x:  re.sub(r'3544','',x):
        return "35-44"
    elif lambda x:  re.sub(r'4554','',x):
        return "45-54"
    elif lambda x:  re.sub(r'5564','',x):
        return "55-64"
    else:
        return 'N/A'
    # Add elif statements....

df_long['Age_Category'] = df_long['Age'].apply(func1)

print(df_long.tail(10))

         country  year      new_sp  Cases    Sex Age Age_Category  \
405430  Zimbabwe  2004  newrel_f65    NaN  women  65         0-14
405431  Zimbabwe  2005  newrel_f65    NaN  women  65         0-14
405432  Zimbabwe  2006  newrel_f65    NaN  women  65         0-14
405433  Zimbabwe  2007  newrel_f65    NaN  women  65         0-14
405434  Zimbabwe  2008  newrel_f65    NaN  women  65         0-14
405435  Zimbabwe  2009  newrel_f65    NaN  women  65         0-14
405436  Zimbabwe  2010  newrel_f65    NaN  women  65         0-14
405437  Zimbabwe  2011  newrel_f65    NaN  women  65         0-14
405438  Zimbabwe  2012  newrel_f65    NaN  women  65         0-14
405439  Zimbabwe  2013  newrel_f65  725.0  women  65         0-14

       Age_Category1
405430          0-14
405431          0-14
405432          0-14
405433          0-14
405434          0-14
405435          0-14
405436          0-14
405437          0-14
405438          0-14
405439          0-14

#### Question 3: Create a graph that shows when countries started to report TB cases.

In [ ]:
# Code